CSI API ETABS v1

# cAreaObjGetGUID Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetGUID(
    	string Name,
    	ref string GUID
    )

    Function GetGUID (
    	Name As String,
    	ByRef GUID As String
    ) As Integer

    Dim instance As cAreaObj
    Dim Name As String
    Dim GUID As String
    Dim returnValue As Integer

    returnValue = instance.GetGUID(Name, GUID)

    int GetGUID(
    	String^ Name,
    	String^% GUID
    )

    abstract GetGUID :
            Name : string *
            GUID : string byref -> int

#### Parameters

Name

    Type: SystemString

GUID

    Type: SystemString

#### Return Value

Type: Int32

See Also

#### Reference

cAreaObj Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com